# Задание 1 Создать функцию, которая выводит на экран цифру, введенную пользоватлем в консоли.
def pervayafunctia ():
    print('Введите значение:')
    a = int(input())
    print('Ваша введеное значение:')
    print(a)


pervayafunctia()

